In [ ]:
people = {"first":["Corey", "Jane", "John"],
          "last": ["Schafer", "Doe", "Doe"],
          "email":["CoreyMSchafter@gamil.com", "JaneDoe@email.com", "JohnDoe@email.com"]}

In [ ]:
import pandas as pd

In [ ]:
df = pd.DataFrame(people)
df

   first     last                     email
0  Corey  Schafer  CoreyMSchafter@gamil.com
1   Jane      Doe         JaneDoe@email.com
2   John      Doe         JohnDoe@email.com

In [ ]:
df["first"] + " " + df["last"]

0    Corey Schafer
1         Jane Doe
2         John Doe
dtype: object

In [ ]:
df["full_name"] = df["first"] + " " + df["last"] # add a column at the end

In [ ]:
df.drop(columns = ["first", "last"], inplace=True)

In [ ]:
df

                      email      full_name
0  CoreyMSchafter@gamil.com  Corey Schafer
1         JaneDoe@email.com       Jane Doe
2         JohnDoe@email.com       John Doe

In [ ]:
df["full_name"].str.split(" ", expand =True) # split columns

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John      Doe

In [ ]:
df[["first", "last"]] = df["full_name"].str.split(" ", expand =True) # split columns

In [ ]:
df

                      email      full_name  first     last
0  CoreyMSchafter@gamil.com  Corey Schafer  Corey  Schafer
1         JaneDoe@email.com       Jane Doe   Jane      Doe
2         JohnDoe@email.com       John Doe   John      Doe

In [ ]:
df.append({"first":"Tony"}, ignore_index=True) # add a row

                      email      full_name  first     last
0  CoreyMSchafter@gamil.com  Corey Schafer  Corey  Schafer
1         JaneDoe@email.com       Jane Doe   Jane      Doe
2         JohnDoe@email.com       John Doe   John      Doe
3                       NaN            NaN   Tony      NaN

In [ ]:
people = {"first":["Tony", "Steve"],
          "last": ["Stark", "Rogers"],
          "email":["Ironman@revenge.com", "Cap@avente.com"]}
df2 = pd.DataFrame(people)

In [ ]:
df.append(df2,ignore_index =True, sort=False) # append row

   first     last                     email
0  Corey  Schafer  CoreyMSchafter@gamil.com
1   Jane      Doe         JaneDoe@email.com
2   John      Doe         JohnDoe@email.com
3   Tony    Stark       Ironman@revenge.com
4  Steve   Rogers            Cap@avente.com

In [ ]:
df = df.append(df2,ignore_index =True, sort=False) # append row
df

   first     last                     email
0  Corey  Schafer  CoreyMSchafter@gamil.com
1   Jane      Doe         JaneDoe@email.com
2   John      Doe         JohnDoe@email.com
3   Tony    Stark       Ironman@revenge.com
4  Steve   Rogers            Cap@avente.com
5   Tony    Stark       Ironman@revenge.com
6  Steve   Rogers            Cap@avente.com

In [ ]:
df.drop(index= 6) # remove by index

                      email      full_name  first     last
0  CoreyMSchafter@gamil.com  Corey Schafer  Corey  Schafer
1         JaneDoe@email.com       Jane Doe   Jane      Doe
2         JohnDoe@email.com       John Doe   John      Doe
3       Ironman@revenge.com            NaN   Tony    Stark
4            Cap@avente.com            NaN  Steve   Rogers
5       Ironman@revenge.com            NaN   Tony    Stark

In [ ]:
filt = df["last"] == "Doe"
df.drop(index= df[filt].index)

                      email      full_name  first     last
0  CoreyMSchafter@gamil.com  Corey Schafer  Corey  Schafer
3       Ironman@revenge.com            NaN   Tony    Stark
4            Cap@avente.com            NaN  Steve   Rogers
5       Ironman@revenge.com            NaN   Tony    Stark
6            Cap@avente.com            NaN  Steve   Rogers

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

In [ ]:
import pandas as pd

In [ ]:
df = pd.read_csv("/content/drive/MyDrive/data/survey_results_public.csv", index_col="Respondent") #index_col= changes the index to Respondent
#df
pd.set_option("display.max_columns", 85) #显示最大数目column
pd.set_option("display.max_rows", 85)
schema_df = pd.read_csv("/content/drive/MyDrive/data/survey_results_schema.csv", index_col="Column")
#schema_df